jantielens/esp32-macropad/src/app/device_telemetry.cpp
static void sample_internal_largest_if_due(uint32_t now_ms) {
#if TELEMETRY_CACHE_INTERNAL_POOL_WALK
		if (g_last_internal_pool_walk_ms != 0 &&
				(uint32_t)(now_ms - g_last_internal_pool_walk_ms) < kInternalPoolWalkPeriodMs) {
				return;
		}

		// The timer daemon performs the walks; request handlers read only these copies.
		const size_t internal_largest = heap_caps_get_largest_free_block(MALLOC_CAP_INTERNAL | MALLOC_CAP_8BIT);
		const size_t dma_internal_largest = heap_caps_get_largest_free_block(MALLOC_CAP_DMA | MALLOC_CAP_INTERNAL);
		portENTER_CRITICAL(&g_health_window_mux);
		g_cached_internal_largest = internal_largest;
		g_cached_dma_internal_largest = dma_internal_largest;
		g_cached_internal_largest_valid = true;
		g_last_internal_pool_walk_ms = now_ms;
		portEXIT_CRITICAL(&g_health_window_mux);
#else
		(void)now_ms;
#endif
}

static size_t get_internal_largest_free_block() {
#if TELEMETRY_CACHE_INTERNAL_POOL_WALK
		size_t largest = 0;
		portENTER_CRITICAL(&g_health_window_mux);
		if (g_cached_internal_largest_valid) {
				largest = g_cached_internal_largest;
		}
		portEXIT_CRITICAL(&g_health_window_mux);
		return largest;
#else
		return heap_caps_get_largest_free_block(MALLOC_CAP_INTERNAL | MALLOC_CAP_8BIT);
#endif
}

static size_t get_dma_internal_largest_free_block() {
#if TELEMETRY_CACHE_INTERNAL_POOL_WALK
		size_t largest = 0;
		portENTER_CRITICAL(&g_health_window_mux);
		if (g_cached_internal_largest_valid) {
				largest = g_cached_dma_internal_largest;
		}
		portEXIT_CRITICAL(&g_health_window_mux);
		return largest;
#else
		return heap_caps_get_largest_free_block(MALLOC_CAP_DMA | MALLOC_CAP_INTERNAL);
#endif
}

// Flash/sketch metadata caching (avoid re-entrant ESP-IDF image/mmap helpers)
static bool flash_cache_initialized = false;
static size_t cached_sketch_size = 0;
static size_t cached_free_sketch_space = 0;

// Persistent temperature sensor handle (installed once, kept enabled).
#if SOC_TEMP_SENSOR_SUPPORTED
static temperature_sensor_handle_t s_temp_sensor = nullptr;
#endif

static void fill_common(JsonDocument &doc, bool include_ip_and_channel, bool include_api_only_fields, bool include_mqtt_self_report);

static void fill_health_window_fields(JsonDocument &doc);

struct HealthWindowComputed {
		uint32_t heap_internal_free_min_window;
		uint32_t heap_internal_free_max_window;

		int heap_fragmentation_max_window;

		uint32_t psram_free_min_window;
		uint32_t psram_free_max_window;
};

static bool compute_health_window_computed(HealthWindowComputed* out);

static void health_window_get_snapshot(
		HealthWindowStats* out_last,
		bool* out_has_last,
		HealthWindowStats* out_current,
		unsigned long* out_current_start_ms,
		unsigned long* out_last_start_ms,
		unsigned long* out_last_end_ms
);

static void get_memory_snapshot(
		size_t *out_heap_free,
		size_t *out_heap_min,
		size_t *out_heap_largest,
		size_t *out_internal_free,
		size_t *out_internal_min,
		size_t *out_psram_free,
		size_t *out_psram_min,
		size_t *out_psram_largest
);

// 1 Hz timer callback — reads per-core idle-task run-time counters (microseconds)
// and derives CPU% from the delta.  Runs in esp_timer task context.
static void cpu_timer_cb(void*) {
#if TELEMETRY_HAS_PER_CORE_IDLE_COUNTER
	const int64_t wall_now = esp_timer_get_time();  // microseconds since boot

	if (s_cpu_first_sample) {
		for (int c = 0; c < portNUM_PROCESSORS; c++) {
			s_idle_rt_last[c] = ulTaskGetIdleRunTimeCounterForCore(c);
		}
		s_wall_us_last = wall_now;
		s_cpu_first_sample = false;
		return;
	}

	const int64_t wall_delta = wall_now - s_wall_us_last;
	if (wall_delta <= 0) return;

	// Sum idle microseconds across all cores.
	int64_t idle_us_total = 0;
	for (int c = 0; c < portNUM_PROCESSORS; c++) {
		const configRUN_TIME_COUNTER_TYPE cur = ulTaskGetIdleRunTimeCounterForCore(c);
		idle_us_total += (int64_t)(cur - s_idle_rt_last[c]);
		s_idle_rt_last[c] = cur;
	}
	s_wall_us_last = wall_now;

	// Total available CPU time = wall_delta * number_of_cores.
	const int64_t total_cpu_us = wall_delta * portNUM_PROCESSORS;

	int usage = (int)(100 - (idle_us_total * 100 / total_cpu_us));
	if (usage < 0)   usage = 0;
	if (usage > 100)  usage = 100;

	s_cpu_usage = usage;
#else
	// Per-core idle-counter API unavailable on this IDF — leave s_cpu_usage at -1.
	(void)0;
#endif
}

static void health_window_timer_cb(TimerHandle_t) {
		// Counter reads every tick; internal largest-block is sampled separately
		// at a slow cadence when this board caches allocator walks.
		const size_t internal_free = heap_caps_get_free_size(MALLOC_CAP_INTERNAL | MALLOC_CAP_8BIT);
		const size_t psram_free = heap_caps_get_free_size(MALLOC_CAP_SPIRAM);

		sample_internal_largest_if_due((uint32_t)millis());
		health_window_update_sample(internal_free, psram_free);
}

static void health_window_get_snapshot(
		HealthWindowStats* out_last,
		bool* out_has_last,
		HealthWindowStats* out_current,
		unsigned long* out_current_start_ms,
		unsigned long* out_last_start_ms,
		unsigned long* out_last_end_ms
) {
		if (!out_last || !out_has_last || !out_current || !out_current_start_ms || !out_last_start_ms || !out_last_end_ms) {
				return;
		}

		portENTER_CRITICAL(&g_health_window_mux);
		*out_last = g_health_window_last;
		*out_has_last = g_health_window_last_valid;
		*out_current = g_health_window_current;
		*out_current_start_ms = g_health_window_current_start_ms;
		*out_last_start_ms = g_health_window_last_start_ms;
		*out_last_end_ms = g_health_window_last_end_ms;
		portEXIT_CRITICAL(&g_health_window_mux);
}

DeviceMemorySnapshot device_telemetry_get_memory_snapshot() {
		DeviceMemorySnapshot snapshot = {};

		get_memory_snapshot(
				&snapshot.heap_free_bytes,
				&snapshot.heap_min_free_bytes,
				&snapshot.heap_largest_free_block_bytes,
				&snapshot.heap_internal_free_bytes,
				&snapshot.heap_internal_min_free_bytes,
				&snapshot.psram_free_bytes,
				&snapshot.psram_min_free_bytes,
				&snapshot.psram_largest_free_block_bytes
		);

		return snapshot;
}

