jantielens/esp32-macropad/src/app/device_telemetry.cpp
#if SOC_TEMP_SENSOR_SUPPORTED
		if (!s_temp_sensor) {
				temperature_sensor_config_t cfg = TEMPERATURE_SENSOR_CONFIG_DEFAULT(-10, 80);
				if (temperature_sensor_install(&cfg, &s_temp_sensor) == ESP_OK) {
						if (temperature_sensor_enable(s_temp_sensor) != ESP_OK) {
								temperature_sensor_uninstall(s_temp_sensor);
								s_temp_sensor = nullptr;
						}
				} else {
						s_temp_sensor = nullptr;
				}
		}
#endif
}

size_t device_telemetry_sketch_size() {
		if (!flash_cache_initialized) {
				device_telemetry_init();
		}
		return cached_sketch_size;
}

size_t device_telemetry_free_sketch_space() {
		if (!flash_cache_initialized) {
				device_telemetry_init();
		}
		return cached_free_sketch_space;
}

// Start a 1 Hz timer that reads per-core idle-task run-time counters.
void device_telemetry_start_cpu_monitoring() {
#if !TELEMETRY_HAS_PER_CORE_IDLE_COUNTER
		// Older IDF — no per-core idle-counter API; report CPU% as unavailable.
		LOGI("CPU", "Per-core idle-counter API unavailable on this IDF; CPU monitor disabled");
		return;
#else
		if (s_cpu_timer != nullptr) return;  // Already started

		// Create a periodic 1 Hz esp_timer to compute the delta.
		const esp_timer_create_args_t args = {
				.callback = cpu_timer_cb,
				.arg = nullptr,
				.dispatch_method = ESP_TIMER_TASK,
				.name = "cpu_usage",
				.skip_unhandled_events = true,
		};

		esp_err_t err = esp_timer_create(&args, &s_cpu_timer);
		if (err != ESP_OK) {
				LOGE("CPU", "Failed to create timer: %s", esp_err_to_name(err));
				return;
		}

		err = esp_timer_start_periodic(s_cpu_timer, 1000000);  // 1 s
		if (err != ESP_OK) {
				LOGE("CPU", "Failed to start timer: %s", esp_err_to_name(err));
				esp_timer_delete(s_cpu_timer);
				s_cpu_timer = nullptr;
				return;
		}

		LOGI("CPU", "Run-time-stats CPU monitor started (%d core%s)",
				portNUM_PROCESSORS, portNUM_PROCESSORS > 1 ? "s" : "");
#endif
}

int device_telemetry_get_cpu_usage() {
		return s_cpu_usage;  // Atomic read of a volatile int
}

void device_telemetry_start_health_window_sampling() {
		if (g_health_window_timer != nullptr) return;

		health_window_reset();
		g_health_window_timer = xTimerCreate(
				"health_win",
				pdMS_TO_TICKS(kHealthWindowSamplePeriodMs),
				pdTRUE,
				nullptr,
				health_window_timer_cb
		);

		if (!g_health_window_timer) {
				LOGE("Health", "Failed to create health window timer");
				return;
		}

		if (xTimerStart(g_health_window_timer, 0) != pdPASS) {
				LOGE("Health", "Failed to start health window timer");
				xTimerDelete(g_health_window_timer, 0);
				g_health_window_timer = nullptr;
				return;
		}
}

static void fill_health_window_fields(JsonDocument &doc) {
		HealthWindowComputed c = {};
		if (!compute_health_window_computed(&c)) {
				return;
		}

		doc["heap_internal_free_min_window"] = c.heap_internal_free_min_window;
		doc["heap_internal_free_max_window"] = c.heap_internal_free_max_window;
		doc["heap_fragmentation_max_window"] = c.heap_fragmentation_max_window;

		doc["psram_free_min_window"] = c.psram_free_min_window;
		doc["psram_free_max_window"] = c.psram_free_max_window;
}

static bool compute_health_window_computed(HealthWindowComputed* out) {
		if (!out) return false;

		HealthWindowStats last = {};
		HealthWindowStats current = {};
		bool has_last = false;
		unsigned long current_start_ms = 0;
		unsigned long last_start_ms = 0;
		unsigned long last_end_ms = 0;

		health_window_get_snapshot(&last, &has_last, &current, &current_start_ms, &last_start_ms, &last_end_ms);

		// Fold in instantaneous request-time values to guarantee the
		// returned band contains the point-in-time fields, even between samples.
		const size_t internal_free_now = heap_caps_get_free_size(MALLOC_CAP_INTERNAL | MALLOC_CAP_8BIT);
		const size_t psram_free_now = heap_caps_get_free_size(MALLOC_CAP_SPIRAM);

		const size_t internal_largest_now = get_internal_largest_free_block();
		const int internal_frag_now = compute_fragmentation_percent(internal_free_now, internal_largest_now);

		// Merge last-complete and current-in-progress windows.
		HealthWindowStats merged = {};

		const bool has_current = current.initialized;
		const bool has_any = (has_current || (has_last && last.initialized));
		if (has_any) {
				merged.initialized = true;

				const HealthWindowStats* base = has_current ? &current : &last;
				merged.internal_free_min = base->internal_free_min;
				merged.internal_free_max = base->internal_free_max;
				merged.psram_free_min = base->psram_free_min;
				merged.psram_free_max = base->psram_free_max;

				if (has_current && has_last && last.initialized) {
						if (last.internal_free_min < merged.internal_free_min) merged.internal_free_min = last.internal_free_min;
						if (last.internal_free_max > merged.internal_free_max) merged.internal_free_max = last.internal_free_max;
						if (last.psram_free_min < merged.psram_free_min) merged.psram_free_min = last.psram_free_min;
						if (last.psram_free_max > merged.psram_free_max) merged.psram_free_max = last.psram_free_max;
				}
		}

		if (!merged.initialized) {
				merged.initialized = true;
				merged.internal_free_min = internal_free_now;
				merged.internal_free_max = internal_free_now;
				merged.psram_free_min = psram_free_now;
				merged.psram_free_max = psram_free_now;
		}

		// Guarantee instantaneous values are within the returned band.
		if (internal_free_now < merged.internal_free_min) merged.internal_free_min = internal_free_now;
		if (internal_free_now > merged.internal_free_max) merged.internal_free_max = internal_free_now;
		if (psram_free_now < merged.psram_free_min) merged.psram_free_min = psram_free_now;
		if (psram_free_now > merged.psram_free_max) merged.psram_free_max = psram_free_now;

		out->heap_internal_free_min_window = (uint32_t)merged.internal_free_min;
		out->heap_internal_free_max_window = (uint32_t)merged.internal_free_max;
		out->heap_fragmentation_max_window = internal_frag_now;
		out->psram_free_min_window = (uint32_t)merged.psram_free_min;
		out->psram_free_max_window = (uint32_t)merged.psram_free_max;

